Revit 2027 API
Viewport.HasViewportTransforms Method
 Indicates if the viewport has transforms.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasViewportTransforms()
Public Function HasViewportTransforms As Boolean
public:
bool HasViewportTransforms()
member HasViewportTransforms : unit -> bool
Return Value
Boolean
 True if the viewport has transforms, false otherwise.
Remarks
 Not all viewports have transforms. For example, viewports for schedules and legends do not have transforms.
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace